/* automatically generated by rust-bindgen 0.72.0 */

pub const IMAGE_RESOLUTION: ::std::os::raw::c_uint = 448;
pub const NUM_CHANNELS: ::std::os::raw::c_uint = 3;
pub const NUM_CLASSES: ::std::os::raw::c_uint = 3;
pub const SIZE_Y: ::std::os::raw::c_uint = 448;
pub const SIZE_X: ::std::os::raw::c_uint = 448;
pub const SIZE_C: ::std::os::raw::c_uint = 3;
pub const SIZE_O: ::std::os::raw::c_uint = 3;
pub type intype = f32;
pub type outtype = f32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arg_input {
    pub val: [[[intype; 3usize]; 448usize]; 448usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of arg_input"][::std::mem::size_of::<arg_input>() - 2408448usize];
    ["Alignment of arg_input"][::std::mem::align_of::<arg_input>() - 4usize];
    ["Offset of field: arg_input::val"][::std::mem::offset_of!(arg_input, val) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arg_output {
    pub val: [outtype; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of arg_output"][::std::mem::size_of::<arg_output>() - 12usize];
    ["Alignment of arg_output"][::std::mem::align_of::<arg_output>() - 4usize];
    ["Offset of field: arg_output::val"][::std::mem::offset_of!(arg_output, val) - 0usize];
};
unsafe extern "C" {
    pub fn mylibtorchinfer(
        in_: *mut arg_input,
        batch_size: ::std::os::raw::c_uint,
        out: *mut arg_output,
    );
}
unsafe extern "C" {
    pub fn decode_image_data(
        binary_data: *mut ::std::os::raw::c_uchar,
        data_size: ::std::os::raw::c_int,
        dst_struct: *mut arg_input,
    ) -> bool;
}
